MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAB176/mcu.h
  .extern T3CON            /* 0xBF840400 */
  .extern T3CONCLR         /* 0xBF840404 */
  .extern T3CONSET         /* 0xBF840408 */
  .extern T3CONINV         /* 0xBF84040C */
  .extern TMR3             /* 0xBF840410 */
  .extern TMR3CLR          /* 0xBF840414 */
  .extern TMR3SET          /* 0xBF840418 */
  .extern TMR3INV          /* 0xBF84041C */
  .extern _PR3              /* 0xBF840420 */  // Note: Changed by MikroE
  .extern PR3CLR           /* 0xBF840424 */
  .extern PR3SET           /* 0xBF840428 */
  .extern PR3INV           /* 0xBF84042C */
  .extern T4CON            /* 0xBF840600 */
  .extern T4CONCLR         /* 0xBF840604 */
  .extern T4CONSET         /* 0xBF840608 */
  .extern T4CONINV         /* 0xBF84060C */
  .extern TMR4             /* 0xBF840610 */
  .extern TMR4CLR          /* 0xBF840614 */
  .extern TMR4SET          /* 0xBF840618 */
  .extern TMR4INV          /* 0xBF84061C */
  .extern _PR4              /* 0xBF840620 */  // Note: Changed by MikroE
  .extern PR4CLR           /* 0xBF840624 */
  .extern PR4SET           /* 0xBF840628 */
  .extern PR4INV           /* 0xBF84062C */
  .extern T5CON            /* 0xBF840800 */
  .extern T5CONCLR         /* 0xBF840804 */
  .extern T5CONSET         /* 0xBF840808 */
  .extern T5CONINV         /* 0xBF84080C */
  .extern TMR5             /* 0xBF840810 */
  .extern TMR5CLR          /* 0xBF840814 */
  .extern TMR5SET          /* 0xBF840818 */
  .extern TMR5INV          /* 0xBF84081C */
  .extern _PR5              /* 0xBF840820 */  // Note: Changed by MikroE
  .extern PR5CLR           /* 0xBF840824 */
  .extern PR5SET           /* 0xBF840828 */
  .extern PR5INV           /* 0xBF84082C */
  .extern T6CON            /* 0xBF840A00 */
  .extern T6CONCLR         /* 0xBF840A04 */
  .extern T6CONSET         /* 0xBF840A08 */
  .extern T6CONINV         /* 0xBF840A0C */
  .extern TMR6             /* 0xBF840A10 */
  .extern TMR6CLR          /* 0xBF840A14 */
  .extern TMR6SET          /* 0xBF840A18 */
  .extern TMR6INV          /* 0xBF840A1C */
  .extern _PR6              /* 0xBF840A20 */  // Note: Changed by MikroE
  .extern PR6CLR           /* 0xBF840A24 */
  .extern PR6SET           /* 0xBF840A28 */
  .extern PR6INV           /* 0xBF840A2C */
  .extern T7CON            /* 0xBF840C00 */
  .extern T7CONCLR         /* 0xBF840C04 */
  .extern T7CONSET         /* 0xBF840C08 */
  .extern T7CONINV         /* 0xBF840C0C */
  .extern TMR7             /* 0xBF840C10 */
  .extern TMR7CLR          /* 0xBF840C14 */
  .extern TMR7SET          /* 0xBF840C18 */
  .extern TMR7INV          /* 0xBF840C1C */
  .extern _PR7              /* 0xBF840C20 */  // Note: Changed by MikroE
  .extern PR7CLR           /* 0xBF840C24 */
  .extern PR7SET           /* 0xBF840C28 */
  .extern PR7INV           /* 0xBF840C2C */
  .extern T8CON            /* 0xBF840E00 */
  .extern T8CONCLR         /* 0xBF840E04 */
  .extern T8CONSET         /* 0xBF840E08 */
  .extern T8CONINV         /* 0xBF840E0C */
  .extern TMR8             /* 0xBF840E10 */
  .extern TMR8CLR          /* 0xBF840E14 */
  .extern TMR8SET          /* 0xBF840E18 */
  .extern TMR8INV          /* 0xBF840E1C */
  .extern _PR8              /* 0xBF840E20 */  // Note: Changed by MikroE
  .extern PR8CLR           /* 0xBF840E24 */
  .extern PR8SET           /* 0xBF840E28 */
  .extern PR8INV           /* 0xBF840E2C */
  .extern T9CON            /* 0xBF841000 */
  .extern T9CONCLR         /* 0xBF841004 */
  .extern T9CONSET         /* 0xBF841008 */
  .extern T9CONINV         /* 0xBF84100C */
  .extern TMR9             /* 0xBF841010 */
  .extern TMR9CLR          /* 0xBF841014 */
  .extern TMR9SET          /* 0xBF841018 */
  .extern TMR9INV          /* 0xBF84101C */
  .extern _PR9              /* 0xBF841020 */  // Note: Changed by MikroE
  .extern PR9CLR           /* 0xBF841024 */
  .extern PR9SET           /* 0xBF841028 */
  .extern PR9INV           /* 0xBF84102C */
  .extern IC1CON           /* 0xBF842000 */
  .extern IC1CONCLR        /* 0xBF842004 */
  .extern IC1CONSET        /* 0xBF842008 */
  .extern IC1CONINV        /* 0xBF84200C */
  .extern IC1BUF           /* 0xBF842010 */
  .extern IC2CON           /* 0xBF842200 */
  .extern IC2CONCLR        /* 0xBF842204 */
  .extern IC2CONSET        /* 0xBF842208 */
  .extern IC2CONINV        /* 0xBF84220C */
  .extern IC2BUF           /* 0xBF842210 */
  .extern IC3CON           /* 0xBF842400 */
  .extern IC3CONCLR        /* 0xBF842404 */
  .extern IC3CONSET        /* 0xBF842408 */
  .extern IC3CONINV        /* 0xBF84240C */
  .extern IC3BUF           /* 0xBF842410 */
  .extern IC4CON           /* 0xBF842600 */
  .extern IC4CONCLR        /* 0xBF842604 */
  .extern IC4CONSET        /* 0xBF842608 */
  .extern IC4CONINV        /* 0xBF84260C */
  .extern IC4BUF           /* 0xBF842610 */
  .extern IC5CON           /* 0xBF842800 */
  .extern IC5CONCLR        /* 0xBF842804 */
  .extern IC5CONSET        /* 0xBF842808 */
  .extern IC5CONINV        /* 0xBF84280C */
  .extern IC5BUF           /* 0xBF842810 */
  .extern IC6CON           /* 0xBF842A00 */
  .extern IC6CONCLR        /* 0xBF842A04 */
  .extern IC6CONSET        /* 0xBF842A08 */
  .extern IC6CONINV        /* 0xBF842A0C */
  .extern IC6BUF           /* 0xBF842A10 */
  .extern IC7CON           /* 0xBF842C00 */
  .extern IC7CONCLR        /* 0xBF842C04 */
  .extern IC7CONSET        /* 0xBF842C08 */
  .extern IC7CONINV        /* 0xBF842C0C */
  .extern IC7BUF           /* 0xBF842C10 */
  .extern IC8CON           /* 0xBF842E00 */
  .extern IC8CONCLR        /* 0xBF842E04 */
  .extern IC8CONSET        /* 0xBF842E08 */
  .extern IC8CONINV        /* 0xBF842E0C */
  .extern IC8BUF           /* 0xBF842E10 */
  .extern IC9CON           /* 0xBF843000 */
  .extern IC9CONCLR        /* 0xBF843004 */
  .extern IC9CONSET        /* 0xBF843008 */
  .extern IC9CONINV        /* 0xBF84300C */
  .extern IC9BUF           /* 0xBF843010 */
  .extern OC1CON           /* 0xBF844000 */
  .extern OC1CONCLR        /* 0xBF844004 */
  .extern OC1CONSET        /* 0xBF844008 */
  .extern OC1CONINV        /* 0xBF84400C */
  .extern OC1R             /* 0xBF844010 */
  .extern OC1RCLR          /* 0xBF844014 */
  .extern OC1RSET          /* 0xBF844018 */
  .extern OC1RINV          /* 0xBF84401C */
  .extern OC1RS            /* 0xBF844020 */
  .extern OC1RSCLR         /* 0xBF844024 */
  .extern OC1RSSET         /* 0xBF844028 */
  .extern OC1RSINV         /* 0xBF84402C */
  .extern OC2CON           /* 0xBF844200 */
  .extern OC2CONCLR        /* 0xBF844204 */
  .extern OC2CONSET        /* 0xBF844208 */
  .extern OC2CONINV        /* 0xBF84420C */
  .extern OC2R             /* 0xBF844210 */
  .extern OC2RCLR          /* 0xBF844214 */
  .extern OC2RSET          /* 0xBF844218 */
  .extern OC2RINV          /* 0xBF84421C */
  .extern OC2RS            /* 0xBF844220 */
  .extern OC2RSCLR         /* 0xBF844224 */
  .extern OC2RSSET         /* 0xBF844228 */
  .extern OC2RSINV         /* 0xBF84422C */
  .extern OC3CON           /* 0xBF844400 */
  .extern OC3CONCLR        /* 0xBF844404 */
  .extern OC3CONSET        /* 0xBF844408 */
  .extern OC3CONINV        /* 0xBF84440C */
  .extern OC3R             /* 0xBF844410 */
  .extern OC3RCLR          /* 0xBF844414 */
  .extern OC3RSET          /* 0xBF844418 */
  .extern OC3RINV          /* 0xBF84441C */
  .extern OC3RS            /* 0xBF844420 */
  .extern OC3RSCLR         /* 0xBF844424 */
  .extern OC3RSSET         /* 0xBF844428 */
  .extern OC3RSINV         /* 0xBF84442C */
  .extern OC4CON           /* 0xBF844600 */
  .extern OC4CONCLR        /* 0xBF844604 */
  .extern OC4CONSET        /* 0xBF844608 */
  .extern OC4CONINV        /* 0xBF84460C */
  .extern OC4R             /* 0xBF844610 */
  .extern OC4RCLR          /* 0xBF844614 */
  .extern OC4RSET          /* 0xBF844618 */
  .extern OC4RINV          /* 0xBF84461C */
  .extern OC4RS            /* 0xBF844620 */
  .extern OC4RSCLR         /* 0xBF844624 */
  .extern OC4RSSET         /* 0xBF844628 */
  .extern OC4RSINV         /* 0xBF84462C */
  .extern OC5CON           /* 0xBF844800 */
  .extern OC5CONCLR        /* 0xBF844804 */
  .extern OC5CONSET        /* 0xBF844808 */
  .extern OC5CONINV        /* 0xBF84480C */
  .extern OC5R             /* 0xBF844810 */
  .extern OC5RCLR          /* 0xBF844814 */
  .extern OC5RSET          /* 0xBF844818 */
  .extern OC5RINV          /* 0xBF84481C */
  .extern OC5RS            /* 0xBF844820 */
  .extern OC5RSCLR         /* 0xBF844824 */
  .extern OC5RSSET         /* 0xBF844828 */
  .extern OC5RSINV         /* 0xBF84482C */
  .extern OC6CON           /* 0xBF844A00 */
  .extern OC6CONCLR        /* 0xBF844A04 */
  .extern OC6CONSET        /* 0xBF844A08 */
  .extern OC6CONINV        /* 0xBF844A0C */
  .extern OC6R             /* 0xBF844A10 */
  .extern OC6RCLR          /* 0xBF844A14 */
  .extern OC6RSET          /* 0xBF844A18 */
  .extern OC6RINV          /* 0xBF844A1C */
  .extern OC6RS            /* 0xBF844A20 */
  .extern OC6RSCLR         /* 0xBF844A24 */
  .extern OC6RSSET         /* 0xBF844A28 */
  .extern OC6RSINV         /* 0xBF844A2C */
  .extern OC7CON           /* 0xBF844C00 */
  .extern OC7CONCLR        /* 0xBF844C04 */
  .extern OC7CONSET        /* 0xBF844C08 */
  .extern OC7CONINV        /* 0xBF844C0C */
  .extern OC7R             /* 0xBF844C10 */
  .extern OC7RCLR          /* 0xBF844C14 */
  .extern OC7RSET          /* 0xBF844C18 */
  .extern OC7RINV          /* 0xBF844C1C */
  .extern OC7RS            /* 0xBF844C20 */
  .extern OC7RSCLR         /* 0xBF844C24 */
  .extern OC7RSSET         /* 0xBF844C28 */
  .extern OC7RSINV         /* 0xBF844C2C */
  .extern OC8CON           /* 0xBF844E00 */
  .extern OC8CONCLR        /* 0xBF844E04 */
  .extern OC8CONSET        /* 0xBF844E08 */
  .extern OC8CONINV        /* 0xBF844E0C */
  .extern OC8R             /* 0xBF844E10 */
  .extern OC8RCLR          /* 0xBF844E14 */
  .extern OC8RSET          /* 0xBF844E18 */
  .extern OC8RINV          /* 0xBF844E1C */
  .extern OC8RS            /* 0xBF844E20 */
  .extern OC8RSCLR         /* 0xBF844E24 */
  .extern OC8RSSET         /* 0xBF844E28 */
  .extern OC8RSINV         /* 0xBF844E2C */
  .extern OC9CON           /* 0xBF845000 */
  .extern OC9CONCLR        /* 0xBF845004 */
  .extern OC9CONSET        /* 0xBF845008 */
  .extern OC9CONINV        /* 0xBF84500C */
  .extern OC9R             /* 0xBF845010 */
  .extern OC9RCLR          /* 0xBF845014 */
  .extern OC9RSET          /* 0xBF845018 */
  .extern OC9RINV          /* 0xBF84501C */
  .extern OC9RS            /* 0xBF845020 */
  .extern OC9RSCLR         /* 0xBF845024 */
  .extern OC9RSSET         /* 0xBF845028 */
  .extern OC9RSINV         /* 0xBF84502C */
  .extern ADCCON1          /* 0xBF84B000 */
  .extern ADCCON2          /* 0xBF84B004 */
  .extern ADCCON3          /* 0xBF84B008 */
  .extern ADCTRGMODE       /* 0xBF84B00C */
  .extern ADCIMCON1        /* 0xBF84B010 */
  .extern ADCIMCON2        /* 0xBF84B014 */
  .extern ADCIMCON3        /* 0xBF84B018 */
  .extern ADCGIRQEN1       /* 0xBF84B020 */
  .extern ADCGIRQEN2       /* 0xBF84B024 */
  .extern ADCCSS1          /* 0xBF84B028 */
  .extern ADCCSS2          /* 0xBF84B02C */
  .extern ADCDSTAT1        /* 0xBF84B030 */
  .extern ADCDSTAT2        /* 0xBF84B034 */
  .extern ADCCMPEN1        /* 0xBF84B038 */
  .extern ADCCMP1          /* 0xBF84B03C */
  .extern ADCCMPEN2        /* 0xBF84B040 */
  .extern ADCCMP2          /* 0xBF84B044 */
  .extern ADCCMPEN3        /* 0xBF84B048 */
  .extern ADCCMP3          /* 0xBF84B04C */
  .extern ADCCMPEN4        /* 0xBF84B050 */
  .extern ADCCMP4          /* 0xBF84B054 */
  .extern ADCCMPEN5        /* 0xBF84B058 */
  .extern ADCCMP5          /* 0xBF84B05C */
  .extern ADCCMPEN6        /* 0xBF84B060 */
  .extern ADCCMP6          /* 0xBF84B064 */
  .extern ADCFLTR1         /* 0xBF84B068 */
  .extern ADCFLTR2         /* 0xBF84B06C */
  .extern ADCFLTR3         /* 0xBF84B070 */
  .extern ADCFLTR4         /* 0xBF84B074 */
  .extern ADCFLTR5         /* 0xBF84B078 */
  .extern ADCFLTR6         /* 0xBF84B07C */
  .extern ADCTRG1          /* 0xBF84B080 */
  .extern ADCTRG2          /* 0xBF84B084 */
  .extern ADCTRG3          /* 0xBF84B088 */
  .extern ADCCMPCON1       /* 0xBF84B0A0 */
  .extern ADCCMPCON2       /* 0xBF84B0A4 */
  .extern ADCCMPCON3       /* 0xBF84B0A8 */
  .extern ADCCMPCON4       /* 0xBF84B0AC */
  .extern ADCCMPCON5       /* 0xBF84B0B0 */
  .extern ADCCMPCON6       /* 0xBF84B0B4 */
  .extern ADCFSTAT         /* 0xBF84B0B8 */
  .extern ADCFIFO          /* 0xBF84B0BC */
  .extern ADCBASE          /* 0xBF84B0C0 */
  .extern ADCTRGSNS        /* 0xBF84B0D0 */
  .extern ADC0TIME         /* 0xBF84B0D4 */
  .extern ADC1TIME         /* 0xBF84B0D8 */
  .extern ADC2TIME         /* 0xBF84B0DC */
  .extern ADC3TIME         /* 0xBF84B0E0 */
  .extern ADC4TIME         /* 0xBF84B0E4 */
  .extern ADCEIEN1         /* 0xBF84B0F0 */
  .extern ADCEIEN2         /* 0xBF84B0F4 */
  .extern ADCEISTAT1       /* 0xBF84B0F8 */
  .extern ADCEISTAT2       /* 0xBF84B0FC */
  .extern ADCANCON         /* 0xBF84B100 */
  .extern ADC0CFG          /* 0xBF84B600 */
  .extern ADC1CFG          /* 0xBF84B604 */
  .extern ADC2CFG          /* 0xBF84B608 */
  .extern ADC3CFG          /* 0xBF84B60C */
  .extern ADC4CFG          /* 0xBF84B610 */
  .extern ADC7CFG          /* 0xBF84B61C */
  .extern ADCSYSCFG0       /* 0xBF84B640 */
  .extern ADCSYSCFG1       /* 0xBF84B644 */
  .extern ADCDATA0         /* 0xBF84BA00 */
  .extern ADCDATA1         /* 0xBF84BA04 */
  .extern ADCDATA2         /* 0xBF84BA08 */
  .extern ADCDATA3         /* 0xBF84BA0C */
  .extern ADCDATA4         /* 0xBF84BA10 */
  .extern ADCDATA5         /* 0xBF84BA14 */
  .extern ADCDATA6         /* 0xBF84BA18 */
  .extern ADCDATA7         /* 0xBF84BA1C */
  .extern ADCDATA8         /* 0xBF84BA20 */
  .extern ADCDATA9         /* 0xBF84BA24 */
  .extern ADCDATA10        /* 0xBF84BA28 */
  .extern ADCDATA11        /* 0xBF84BA2C */
  .extern ADCDATA12        /* 0xBF84BA30 */
  .extern ADCDATA13        /* 0xBF84BA34 */
  .extern ADCDATA14        /* 0xBF84BA38 */
  .extern ADCDATA15        /* 0xBF84BA3C */
  .extern ADCDATA16        /* 0xBF84BA40 */
  .extern ADCDATA17        /* 0xBF84BA44 */
  .extern ADCDATA18        /* 0xBF84BA48 */
  .extern ADCDATA19        /* 0xBF84BA4C */
  .extern ADCDATA20        /* 0xBF84BA50 */
  .extern ADCDATA21        /* 0xBF84BA54 */
  .extern ADCDATA22        /* 0xBF84BA58 */
  .extern ADCDATA23        /* 0xBF84BA5C */
  .extern ADCDATA24        /* 0xBF84BA60 */
  .extern ADCDATA25        /* 0xBF84BA64 */
  .extern ADCDATA26        /* 0xBF84BA68 */
  .extern ADCDATA27        /* 0xBF84BA6C */
  .extern ADCDATA28        /* 0xBF84BA70 */
  .extern ADCDATA29        /* 0xBF84BA74 */
  .extern ADCDATA30        /* 0xBF84BA78 */
  .extern ADCDATA31        /* 0xBF84BA7C */
  .extern ADCDATA32        /* 0xBF84BA80 */
  .extern ADCDATA33        /* 0xBF84BA84 */
  .extern ADCDATA34        /* 0xBF84BA88 */
  .extern ADCDATA35        /* 0xBF84BA8C */
  .extern ADCDATA36        /* 0xBF84BA90 */
  .extern ADCDATA37        /* 0xBF84BA94 */
  .extern ADCDATA38        /* 0xBF84BA98 */
  .extern ADCDATA39        /* 0xBF84BA9C */
  .extern ADCDATA40        /* 0xBF84BAA0 */
  .extern ADCDATA41        /* 0xBF84BAA4 */
  .extern ADCDATA42        /* 0xBF84BAA8 */
  .extern ADCDATA43        /* 0xBF84BAAC */
  .extern CM1CON           /* 0xBF84C000 */
  .extern CM1CONCLR        /* 0xBF84C004 */
  .extern CM1CONSET        /* 0xBF84C008 */
  .extern CM1CONINV        /* 0xBF84C00C */
  .extern CM2CON           /* 0xBF84C010 */
  .extern CM2CONCLR        /* 0xBF84C014 */
  .extern CM2CONSET        /* 0xBF84C018 */
  .extern CM2CONINV        /* 0xBF84C01C */
  .extern CMSTAT           /* 0xBF84C060 */
  .extern CMSTATCLR        /* 0xBF84C064 */
  .extern CMSTATSET        /* 0xBF84C068 */
  .extern CMSTATINV        /* 0xBF84C06C */
  .extern CTMUCON          /* 0xBF84C200 */
  .extern CTMUCONCLR       /* 0xBF84C204 */
  .extern CTMUCONSET       /* 0xBF84C208 */
  .extern CTMUCONINV       /* 0xBF84C20C */
  .extern ANSELA           /* 0xBF860000 */
  .extern ANSELACLR        /* 0xBF860004 */
  .extern ANSELASET        /* 0xBF860008 */
  .extern ANSELAINV        /* 0xBF86000C */
  .extern TRISA            /* 0xBF860010 */
  .extern TRISACLR         /* 0xBF860014 */
  .extern TRISASET         /* 0xBF860018 */
  .extern TRISAINV         /* 0xBF86001C */
  .extern PORTA            /* 0xBF860020 */
  .extern PORTACLR         /* 0xBF860024 */
  .extern PORTASET         /* 0xBF860028 */
  .extern PORTAINV         /* 0xBF86002C */
  .extern LATA             /* 0xBF860030 */
  .extern LATACLR          /* 0xBF860034 */
  .extern LATASET          /* 0xBF860038 */
  .extern LATAINV          /* 0xBF86003C */
  .extern ODCA             /* 0xBF860040 */
  .extern ODCACLR          /* 0xBF860044 */
  .extern ODCASET          /* 0xBF860048 */
  .extern ODCAINV          /* 0xBF86004C */
  .extern CNPUA            /* 0xBF860050 */
  .extern CNPUACLR         /* 0xBF860054 */
  .extern CNPUASET         /* 0xBF860058 */
  .extern CNPUAINV         /* 0xBF86005C */
  .extern CNPDA            /* 0xBF860060 */
  .extern CNPDACLR         /* 0xBF860064 */
  .extern CNPDASET         /* 0xBF860068 */
  .extern CNPDAINV         /* 0xBF86006C */
  .extern CNCONA           /* 0xBF860070 */
  .extern CNCONACLR        /* 0xBF860074 */
  .extern CNCONASET        /* 0xBF860078 */
  .extern CNCONAINV        /* 0xBF86007C */
  .extern CNENA            /* 0xBF860080 */
  .extern CNENACLR         /* 0xBF860084 */
  .extern CNENASET         /* 0xBF860088 */
  .extern CNENAINV         /* 0xBF86008C */
  .extern CNSTATA          /* 0xBF860090 */
  .extern CNSTATACLR       /* 0xBF860094 */
  .extern CNSTATASET       /* 0xBF860098 */
  .extern CNSTATAINV       /* 0xBF86009C */
  .extern CNNEA            /* 0xBF8600A0 */
  .extern CNNEACLR         /* 0xBF8600A4 */
  .extern CNNEASET         /* 0xBF8600A8 */
  .extern CNNEAINV         /* 0xBF8600AC */
  .extern CNFA             /* 0xBF8600B0 */
  .extern CNFACLR          /* 0xBF8600B4 */
  .extern CNFASET          /* 0xBF8600B8 */
  .extern CNFAINV          /* 0xBF8600BC */
  .extern SRCON0A          /* 0xBF8600C0 */
  .extern SRCON0ACLR       /* 0xBF8600C4 */
  .extern SRCON0ASET       /* 0xBF8600C8 */
  .extern SRCON0AINV       /* 0xBF8600CC */
  .extern SRCON1A          /* 0xBF8600D0 */
  .extern SRCON1ACLR       /* 0xBF8600D4 */
  .extern SRCON1ASET       /* 0xBF8600D8 */
  .extern SRCON1AINV       /* 0xBF8600DC */
  .extern ANSELB           /* 0xBF860100 */
  .extern ANSELBCLR        /* 0xBF860104 */
  .extern ANSELBSET        /* 0xBF860108 */
  .extern ANSELBINV        /* 0xBF86010C */
  .extern TRISB            /* 0xBF860110 */
  .extern TRISBCLR         /* 0xBF860114 */
  .extern TRISBSET         /* 0xBF860118 */
  .extern TRISBINV         /* 0xBF86011C */
  .extern PORTB            /* 0xBF860120 */
  .extern PORTBCLR         /* 0xBF860124 */
  .extern PORTBSET         /* 0xBF860128 */
  .extern PORTBINV         /* 0xBF86012C */
  .extern LATB             /* 0xBF860130 */
  .extern LATBCLR          /* 0xBF860134 */
  .extern LATBSET          /* 0xBF860138 */
  .extern LATBINV          /* 0xBF86013C */
  .extern ODCB             /* 0xBF860140 */
  .extern ODCBCLR          /* 0xBF860144 */
  .extern ODCBSET          /* 0xBF860148 */
  .extern ODCBINV          /* 0xBF86014C */
  .extern CNPUB            /* 0xBF860150 */
  .extern CNPUBCLR         /* 0xBF860154 */
  .extern CNPUBSET         /* 0xBF860158 */
  .extern CNPUBINV         /* 0xBF86015C */
  .extern CNPDB            /* 0xBF860160 */
  .extern CNPDBCLR         /* 0xBF860164 */
  .extern CNPDBSET         /* 0xBF860168 */
  .extern CNPDBINV         /* 0xBF86016C */
  .extern CNCONB           /* 0xBF860170 */
  .extern CNCONBCLR        /* 0xBF860174 */
  .extern CNCONBSET        /* 0xBF860178 */
  .extern CNCONBINV        /* 0xBF86017C */
  .extern CNENB            /* 0xBF860180 */
  .extern CNENBCLR         /* 0xBF860184 */
  .extern CNENBSET         /* 0xBF860188 */
  .extern CNENBINV         /* 0xBF86018C */
  .extern CNSTATB          /* 0xBF860190 */
  .extern CNSTATBCLR       /* 0xBF860194 */
  .extern CNSTATBSET       /* 0xBF860198 */
  .extern CNSTATBINV       /* 0xBF86019C */
  .extern CNNEB            /* 0xBF8601A0 */
  .extern CNNEBCLR         /* 0xBF8601A4 */
  .extern CNNEBSET         /* 0xBF8601A8 */
  .extern CNNEBINV         /* 0xBF8601AC */
  .extern CNFB             /* 0xBF8601B0 */
  .extern CNFBCLR          /* 0xBF8601B4 */
  .extern CNFBSET          /* 0xBF8601B8 */
  .extern CNFBINV          /* 0xBF8601BC */
  .extern SRCON0B          /* 0xBF8601C0 */
  .extern SRCON0BCLR       /* 0xBF8601C4 */
  .extern SRCON0BSET       /* 0xBF8601C8 */
  .extern SRCON0BINV       /* 0xBF8601CC */
  .extern SRCON1B          /* 0xBF8601D0 */
  .extern SRCON1BCLR       /* 0xBF8601D4 */
  .extern SRCON1BSET       /* 0xBF8601D8 */
  .extern SRCON1BINV       /* 0xBF8601DC */
  .extern ANSELC           /* 0xBF860200 */
  .extern ANSELCCLR        /* 0xBF860204 */
  .extern ANSELCSET        /* 0xBF860208 */
  .extern ANSELCINV        /* 0xBF86020C */
  .extern TRISC            /* 0xBF860210 */
  .extern TRISCCLR         /* 0xBF860214 */
  .extern TRISCSET         /* 0xBF860218 */
  .extern TRISCINV         /* 0xBF86021C */
  .extern PORTC            /* 0xBF860220 */
  .extern PORTCCLR         /* 0xBF860224 */
  .extern PORTCSET         /* 0xBF860228 */
  .extern PORTCINV         /* 0xBF86022C */
  .extern LATC             /* 0xBF860230 */
  .extern LATCCLR          /* 0xBF860234 */
  .extern LATCSET          /* 0xBF860238 */
  .extern LATCINV          /* 0xBF86023C */
  .extern ODCC             /* 0xBF860240 */
  .extern ODCCCLR          /* 0xBF860244 */
  .extern ODCCSET          /* 0xBF860248 */
  .extern ODCCINV          /* 0xBF86024C */
  .extern CNPUC            /* 0xBF860250 */
  .extern CNPUCCLR         /* 0xBF860254 */
  .extern CNPUCSET         /* 0xBF860258 */
  .extern CNPUCINV         /* 0xBF86025C */
  .extern CNPDC            /* 0xBF860260 */
  .extern CNPDCCLR         /* 0xBF860264 */
  .extern CNPDCSET         /* 0xBF860268 */
  .extern CNPDCINV         /* 0xBF86026C */
  .extern CNCONC           /* 0xBF860270 */
  .extern CNCONCCLR        /* 0xBF860274 */
  .extern CNCONCSET        /* 0xBF860278 */
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern CNNEC            /* 0xBF8602A0 */
  .extern CNNECCLR         /* 0xBF8602A4 */
  .extern CNNECSET         /* 0xBF8602A8 */
  .extern CNNECINV         /* 0xBF8602AC */
  .extern CNFC             /* 0xBF8602B0 */
  .extern CNFCCLR          /* 0xBF8602B4 */
  .extern CNFCSET          /* 0xBF8602B8 */
  .extern CNFCINV          /* 0xBF8602BC */
  .extern SRCON0C          /* 0xBF8602C0 */
  .extern SRCON0CCLR       /* 0xBF8602C4 */
  .extern SRCON0CSET       /* 0xBF8602C8 */
  .extern SRCON0CINV       /* 0xBF8602CC */
  .extern SRCON1C          /* 0xBF8602D0 */
  .extern SRCON1CCLR       /* 0xBF8602D4 */
  .extern SRCON1CSET       /* 0xBF8602D8 */
  .extern SRCON1CINV       /* 0xBF8602DC */
  .extern ANSELD           /* 0xBF860300 */
  .extern ANSELDCLR        /* 0xBF860304 */
  .extern ANSELDSET        /* 0xBF860308 */
  .extern ANSELDINV        /* 0xBF86030C */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
